app/controllers/events_controller.rb

SELECT  1 AS one FROM "babies" WHERE "babies"."user_id" = $1 LIMIT 1  [["user_id", 4]]
SELECT "babies"."id" FROM "babies" WHERE "babies"."user_id" = $1  [["user_id", 4]]
SELECT  "babies".* FROM "babies" WHERE "babies"."id" = $1 LIMIT 1  [["id", 2]]
SELECT "events".* FROM "events" WHERE "events"."baby_id" = $1  [["baby_id", 2]]
---
    def index
      baby_id = (params[:baby_id]).to_i

      if current_user.babies.ids.include?(baby_id)
        @baby = Baby.find(params[:baby_id])
        @events = Baby.find(params[:baby_id]).events

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT 1  [["id", 2]]
SELECT "media".* FROM "media" WHERE "media"."event_id" = $1  [["event_id", 2]]
SELECT "babies"."id" FROM "babies" WHERE "babies"."user_id" = $1  [["user_id", 4]]
SELECT  "babies".* FROM "babies" WHERE "babies"."id" = $1 LIMIT 1  [["id", 3]]
---
    def show

      # images for specific events
      @media = Event.find(params[:id]).media


      baby_id = (params[:baby_id]).to_i

      if current_user.babies.ids.include?(baby_id)
        @baby = Baby.find(params[:baby_id])

SELECT "babies"."id" FROM "babies" WHERE "babies"."user_id" = $1  [["user_id", 4]]
SELECT  "babies".* FROM "babies" WHERE "babies"."id" = $1 LIMIT 1  [["id", 2]]
---
    def new
      baby_id = (params[:baby_id]).to_i

      if current_user.babies.ids.include?(baby_id)
        @event = Event.new
        @baby = Baby.find(params[:baby_id])

SELECT "babies"."id" FROM "babies" WHERE "babies"."user_id" = $1  [["user_id", 4]]
SELECT  "babies".* FROM "babies" WHERE "babies"."id" = $1 LIMIT 1  [["id", 3]]
INSERT INTO "events" ("topic", "body", "baby_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["topic", ""], ["body", ""], ["baby_id", 3], ["created_at", "2015-05-08 04:30:05.701950"], ["updated_at", "2015-05-08 04:30:05.701950"]]
---
    def create
      baby_id = (params[:baby_id]).to_i

      if current_user.babies.ids.include?(baby_id)
        @baby = Baby.find(params[:baby_id])
        @baby.events.create(event_params)