app/controllers/media_controller.rb

SELECT  "babies".* FROM "babies" WHERE "babies"."id" = $1 LIMIT 1  [["id", 3]]
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT 1  [["id", 2]]
---
  def new
    baby_id = (params[:baby_id]).to_i

    if current_user.babies.ids.include?(baby_id)
      @baby = Baby.find(params[:baby_id])
      @event = Event.find(params[:event_id])

SELECT  "babies".* FROM "babies" WHERE "babies"."id" = $1 LIMIT 1  [["id", 3]]
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT 1  [["id", 2]]
INSERT INTO "media" ("url", "event_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["url", "wguuwaxpzchreaz33sic"], ["event_id", 2], ["created_at", "2015-05-08 05:48:04.906536"], ["updated_at", "2015-05-08 05:48:04.906536"]]
---
  def create
    @baby = Baby.find(params[:baby_id])
    @event = Event.find(params[:event_id])

    # params[:url] is an array of the image urls
    preloaded_array = params[:url]

    p "~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ preloaded_array"
    p preloaded_array
    puts "Images: " + preloaded_array.length.to_s

    # render json: params

    p "~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ BABY"
    p @baby
    p "~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ EVENT"

    if preloaded_array.present?

    p @event
    p "~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ SAVING TO MEDIUM MODEL NOW"

      preloaded_array.each do |image|
        # create json object of image's data
        cloudinary_file = Cloudinary::PreloadedFile.new(image)

        p "~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ IMAGE INSTANCE BEING STORED"
        p cloudinary_file

        # add image to media model
        @event.media.find_or_create_by(url: cloudinary_file.public_id)