app/controllers/stats_controller.rb

SELECT "babies"."id" FROM "babies" WHERE "babies"."user_id" = $1  [["user_id", 4]]
---
  def index
    baby_id = (params[:baby_id]).to_i

    if current_user.babies.ids.include?(baby_id)

SELECT "babies"."id" FROM "babies" WHERE "babies"."user_id" = $1  [["user_id", 4]]
---
  def new
    baby_id = (params[:baby_id]).to_i

    if current_user.babies.ids.include?(baby_id)