app/controllers/stats_controller.rb

SELECT  "babies".* FROM "babies" WHERE "babies"."id" = $1 LIMIT 1  [["id", nil]]
SELECT  "stats".* FROM "stats" WHERE "stats"."baby_id" = $1 LIMIT 1  [["baby_id", 2]]
---
  def index
    @stats = Baby.find(params[:baby_id]).stats

SELECT  "babies".* FROM "babies" WHERE "babies"."id" = $1 LIMIT 1  [["id", 2]]
---
  def new
    @stat = Stat.new
    @baby = Baby.find(params[:baby_id])

SELECT  "babies".* FROM "babies" WHERE "babies"."id" = $1 LIMIT 1  [["id", 2]]
INSERT INTO "stats" ("height", "weight", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["height", 34.0], ["weight", 34.0], ["date", "2015-02-01 00:00:00.000000"], ["created_at", "2015-05-07 02:51:02.324937"], ["updated_at", "2015-05-07 02:51:02.324937"]]
---
  def create
    @baby = Baby.find(params[:baby_id])
    @stat = Stat.create(stat_params)